'''
파이썬의 변수명 네이밍 컨벤션 Naming Convention은 자바와 달리 각 단어를 밑줄(_)로 구분하여
표기하는 스네이크 케이스 Snake case 를 따른다. 이는 함수명도 마찬가지다. 

특히 파이썬은 파이썬 다운 방식에 굉장한 자부심이 있기 때문에, 카멜 케이스 뿐만 아니라 자바 스타일로 코딩하는 것을 지양한다. 
(자바에서는 단어별로 대소문자를 구별하여  표기하는 카멜 케이스를 사요ㅕㅇ한다)

파이썬의 pep8 및 철학에 따라 스네이크 코딩을 지향한다고 이야기 할수 있어야 한다

카멜 케이스 vs 스네이크 케이스

카멜 케이스는 낙타 영어로 카멜(camel) 처럼 생긴 것에 유래해 부른 이름이며 단어를 대소문자로 구분하며 섞어서 작명하는 방식으로
자바의 대표적인 표기 방식이기도 하다. 첫 단어의 시작 문자는 소문자로 표기하며, 첫 시작 문자도 대문자로 시작하는 방식은 파스칼 케이스 라 한다.

스네이크 케이스는 뱀(snake) 과 같은 모양에서 유래했으며 각 단어를 언더스코어(_)로 구분한다. 일반적으로 모두 소문자로 표기하지만
경우에 따라 시작문자는 대문자로 표기하기도 한다. 

'''

# 카멜 케이스
camelCase: int = 1

# 스네키으 케이스
snake_case: int = 1
